In [1]:
import numpy as np
import pandas as pd

In [2]:
my_index = ['USA','Canada','Mexico']

In [3]:
mydata = [1733,342,934]

In [4]:
myser = pd.Series(data = mydata)

In [5]:
myser

0    1733
1     342
2     934
dtype: int64

In [7]:
myser = pd.Series(data = mydata,index = my_index)

In [8]:
myser

USA       1733
Canada     342
Mexico     934
dtype: int64

In [9]:
ages = {'Shivansh':34,'Gaurav':54,'Anish':3432,'Shreyash':53}

In [10]:
myages = pd.Series(ages)

In [11]:
myages

Shivansh      34
Gaurav        54
Anish       3432
Shreyash      53
dtype: int64

In [12]:
# Imaginary Sales Data for 1st and 2nd Quarters for Global Company
q1 = {'Japan': 80, 'China': 450, 'India': 200, 'USA': 250}
q2 = {'Brazil': 100,'China': 500, 'India': 210,'USA': 260}

In [13]:
sales_q1 = pd.Series(q1)

In [14]:
sales_q2 = pd.Series(q2)

In [15]:
sales_q1["Japan"]

80

In [16]:
sales_q1[0]

80

In [17]:
sales_q1.keys()

Index(['Japan', 'China', 'India', 'USA'], dtype='object')

In [18]:
sales_q1*2

Japan    160
China    900
India    400
USA      500
dtype: int64

In [19]:
sales_q1/100

Japan    0.8
China    4.5
India    2.0
USA      2.5
dtype: float64

In [20]:
sales_q1+sales_q2

Brazil      NaN
China     950.0
India     410.0
Japan       NaN
USA       510.0
dtype: float64

In [21]:
sales_q1.add(sales_q1,fill_value = 0)

Japan    160
China    900
India    400
USA      500
dtype: int64

In [22]:
np.random.seed(23)
mydata = np.random.randint(0,101,(4,3))

In [23]:
mydata

array([[83, 40, 73],
       [54, 31, 76],
       [91, 39, 90],
       [25, 51,  6]])

In [24]:
myindex = ['Delhi','Kolkata','USa','haridwar']

In [25]:
mycoloumn = ['pop','Aqi','ages']

In [27]:
df = pd.DataFrame(data = mydata,index = myindex,columns = mycoloumn)

In [28]:
df

          pop  Aqi  ages
Delhi      83   40    73
Kolkata    54   31    76
USa        91   39    90
haridwar   25   51     6

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, Delhi to haridwar
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   pop     4 non-null      int32
 1   Aqi     4 non-null      int32
 2   ages    4 non-null      int32
dtypes: int32(3)
memory usage: 80.0+ bytes

In [31]:
df = pd.read_csv('tips.csv')

In [32]:
df

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251
...,...,...,...,...,...,...,...,...,...,...,...
239,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657
240,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404,Sat1766
241,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880
242,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17
243,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139,Thur672